const aboutStorage = [
  {
    id: 1,
    text: `Мне 31 год, у меня 2 высших очных образования и аспирантура за
              плечами. Восемь лет своей жизни я занимался наукой,
              преимущественно философией, и преподаванием, но теперь
              заинтересовался IT, хотя и здесь мне видится философия.
              Программирование для меня - это демиургическая практика, где цифры
              посредствуют логосу, а вечное солнце ноэматического открывается в
              диджитализации, понимаемой как переоткрытие пифагорейских практик.
    `,
  },
  {
    id: 2,
    text: "Я программист самоучка, прошел курсы верстки и js на freecodecamp.org, theodinproject.com, курсы по Реакту и Редаксу в it-kamasutra и вообще на ютубе (больше англоязычном) и по книгам. Решал всякие задачки на codewars и checkio. Читал книги, делал проекты, вот это вот все.",
    text2:
      "Меня интересует прежде всего возможность быстрого роста как специалиста, а потому я ищу для себя мощную команду, чтобы дичайше, например, прокачаться",
  },
];

export default aboutStorage;
